# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

In [29]:
import pandas as pd

In [ ]:
# pd.read_csv()
# pd.read_table()
# pd.read_excel()
# read_sql()
# pd.read_hds
#pd.read_pickle()

In [30]:
df=pd.read_csv('test1.csv')

In [31]:
df

   a   b   c   d message
0  1   2   3   4      hi
1  5   6   7   8   hello
2  9  10  11  12   world

In [32]:
df = pd.read_csv('test1.csv',sep=',')

In [33]:
df

   a   b   c   d message
0  1   2   3   4      hi
1  5   6   7   8   hello
2  9  10  11  12   world

In [34]:
df1 = pd.read_csv('test2.csv',header=None)

In [35]:
df1

   0   1   2   3      4
0  1   2   3   4     hi
1  5   6   7   8  hello
2  9  10  11  12  world

In [36]:
df1 = pd.read_csv('test2.csv',names=['a','b','c','d','message'])

In [37]:
df1

   a   b   c   d message
0  1   2   3   4      hi
1  5   6   7   8   hello
2  9  10  11  12   world

In [38]:
names=['a','b','c','d','message']
pd.read_csv('test2.csv',names=names,index_col='message')

         a   b   c   d
message
hi       1   2   3   4
hello    5   6   7   8
world    9  10  11  12

In [39]:
pd.read_csv('test2.csv',names=names,index_col=['message',"a"])

            b   c   d
message a
hi      1   2   3   4
hello   5   6   7   8
world   9  10  11  12

In [40]:
list(open('table.txt'))

['       A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491\n',
 '\n']

In [41]:
df3 = pd.read_table('table.txt',sep='\s+')

In [42]:
df3

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [43]:
df4 =pd.read_csv('null.csv')

In [44]:
df4

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8    word
2     three  9  10  11.0  12     foo

In [45]:
pd.isnull(df4)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [46]:
df5 =pd.read_csv('null.csv',na_values=['Null'])

In [48]:
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8    word
2     three  9  10  11.0  12     foo

In [49]:
sentils = {'message':['foo','na'],'something':['two']}
pd.read_csv('null.csv',na_values=sentils)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8    word
2     three  9  10  11.0  12     NaN